MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG11B840F1024IL152/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFM32GG11B840F1024IL152_Part */

/***************************************************************************//**
 * @defgroup EFM32GG11B840F1024IL152_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32gg11b_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_ebi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_eth.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_sdio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_prs.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_can_mir.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_can.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_qspi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usb_hc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usb.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_csen.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_etm.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_smu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_trng.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_romtable.h"  // Note: Changed for MikroE implementation.

